import firebase from '../firebaseConfig/fbConfig'

// addPhones()
// addTelevisions()
// addTablets()


function addPhones() {
  console.log('addPhones was called')

  let phones = [
    {//1
      title: 'Iphone 8',
      price: 40000,
      rest: 20,
      description: {
        diagonal: "4.7",
        frontCamera: "7",
        mainCamera: "12",
        processor: "A11",
        memory: "128",
        about: `4.7" Смартфон Apple iPhone 8 64 ГБ – отличное решение для поклонников бренда. Задняя панель устройства теперь выполнена из стекла. Оно закаленное, противостоит внешним воздействиям и появлению царапин. Цвет представленной модели – серый.
        Одна из особенностей – поддержка беспроводной зарядки. Теперь можно пополнять аккумулятор смартфона без применения кабеля. Есть функция быстрой зарядки, но необходимы дополнительные аксессуары.
        Apple iPhone 8 64 ГБ оснащается дисплеем с диагональю 4.7 дюйма. Разрешение 1334х750, качество экрана высокое, он отлично передает цвета. Дисплей может подстраиваться под особенности освещения, чтобы сделать изображение максимально насыщенным.
        Применяется процессор A11 Bionic. Он шестиядерный, тактовая частота – 2.5 ГГц. Графический ускоритель теперь собственной разработки Apple, что положительно сказалось на производительности.
        Камера на 12 Мп с диафрагмой ƒ/1.8. Она помогает получать прекрасные снимки в различных условиях. Удобное приложение позволяет комфортно взаимодействовать с камерой, устройство отлично подбирает параметры в автоматическом режиме, без вмешательства владельца.`
      },
      imgs: ['iPhone/iPhone8/front.png', 'iPhone/iPhone8/back.png']
    },
    {//2
      title: 'Iphone X',
      price: 50000,
      rest: 20,
      description: {
        diagonal: "5.8",
        frontCamera: "12",
        mainCamera: "12",
        processor: "A11",
        memory: "256",
        about: `Смартфон Apple iPhone X в корпусе цвета серого космоса изготовлен из стекла. Диагональ его безрамочного экрана 5.8 дюйма сочетается с разрешением 2436x1125 и плотностью пикселей 458 точек на дюйм. Это делает дисплей идеальным для просмотра видео, фотографий и любой другой графической информации.
        Высочайшая работоспособность модели базируется на процессоре Apple A11 Bionic, графическом ускорителе Apple GPU и оперативной памяти 3 ГБ. Для выполнения идеальных фото и селфи модель имеет две камеры разрешением 7 и 12+12 Мп, дополненных целым набором всевозможных опций и функций для оптимизации изображения, а также защитным сапфировым стеклом шестилинзового объектива. Для обеспечения конфиденциальности хранящихся в смартфоне Apple iPhone X данных в его конструкции предусмотрен сканер лица. Технологии бесконтактной оплаты Apple Pay и модуль NFC расширяют возможности устройства.`
      },
      imgs: ['iPhone/iPhoneX/front.png', 'iPhone/iPhoneX/back.png']
    },
    {//3
      title: 'Iphone 7',
      price: 30000,
      rest: 30,
      description: {
        diagonal: "4.5",
        frontCamera: "7",
        mainCamera: "12",
        processor: "A10",
        memory: "",
        about: `Черный матовый смартфон Apple iPhone 7 хорош с любой точки зрения. Безупречные линии алюминиевого корпуса, 4.7-дюймовый экран с противоударным стеклом, защита от брызг и влаги. Взяв его в руки, становится ясно: это не только высокомощный смартфон со множеством полезных возможностей и интересных опций, это украшение вашего имиджа. Благодаря поддержке множества диапазонов частот в стандартах 3G и 4G(LTE) вам гарантирована кристально чистая связь и быстрый Интернет.
        Камера в 12 Мп с диафрагмой ƒ/1.8 и множеством полезных режимов съемки позволит вам ловить яркие моменты жизни в лучшем свете. Теперь вы можете легко снимать даже ночью. Одно нажатие на кнопку, и у вас готов высококачественный снимок в разрешении 4032x3024 пикселей или видеоролик в качестве Ultra HD 4K. Управлять Apple iPhone 7 максимально просто, ведь на нем установлена грамотно продуманная операционная система iOS 10. А за быстроту работы и загрузки файлов отвечает мощнейший процессор Apple A10 Fusion. Благодаря поддержке Bluetooth 4.2 и NFC меняться файлами проще простого. И не нужно беспокоиться о количестве свободного места в смартфоне, памяти в 32 ГБ хватит надолго.`
      },
      imgs: ['iPhone/iPhone7/front.png', 'iPhone/iPhone7/back.png']
    },
    {//4
      title: 'Iphone 7 Plus',
      price: 35000,
      rest: 10,
      description: {
        diagonal: "4.7",
        frontCamera: "12",
        mainCamera: "12",
        processor: "A10",
        memory: "32",
        about: `Смартфон Apple iPhone 7 Plus в черном матовом корпусе выглядит очень стильно. Представленная модель объединила в себе все самые актуальные разработки популярного бренда. Диагональ экрана равна 5.5", он изготовлен по IPS-технологии. Высокое разрешение (1920x1080) и плотность пикселей 401 ppi обеспечивают качественную передачу миллионов оттенков.
        Удобство управления Apple iPhone 7 Plus обеспечивает ОС iOS. А за производительность отвечает 4-ядерный процессор, частота которого приравнивается к 2.3 ГГц. Предусмотрено 3 ГБ ОЗУ, а общий объем встроенной памяти равен 32 ГБ. Устройство оснащено 2 камерами высокого разрешения. Корпус смартфона произведен из металла, поэтому его довольно сложно повредить. Специальное покрытие экрана предотвращает появление на экране отпечатков и загрязнений.`
      },
      imgs: ['iPhone/iPhone7Plus/front.png', 'iPhone/iPhone7Plus/back.png']
    },
    {//5
      title: 'Iphone 8 Plus',
      price: 45000,
      rest: 10,
      description: {
        diagonal: "5",
        frontCamera: "12",
        mainCamera: "12",
        processor: "A11",
        memory: "128",
        about: `Apple iPhone 8 Plus 128 ГБ – стильный и действительно удобный в использовании аппарат. Для изготовления его корпуса применялись премиальные материалы – стекло и металл. Нанесенное олеофобное покрытие исключает появление следов от пальцев на дисплее и задней крышке устройства. Также стекло хорошо противостоит царапинам.
        Смартфон Apple iPhone 8 Plus 128 ГБ защищен от воды и пыли по стандарту IP67. Можете спокойно пользоваться им и не бояться намочить. Операционная система на устройстве – iOS. Она отличается стильным дизайном, высокой стабильностью, простым интерфейсом. Регулярно разработчик обновляет ОС и всячески улучшает ее.
        Мощный процессор A11 Bionic раскрывает широкие возможности. На смартфоне можно играть, пользоваться любыми необходимыми вам программами. Выполнен чип по техпроцессу 10 нм, он энергоэффективный, благодаря ему увеличивается время автономной работы.
        Смартфоны Apple всегда славились своей камерой. В этот аппарат установлен сдвоенный модуль 12+12 Мп. Вы сможете проводить съемку в различных условиях, получая прекрасные фотографии.`
      },
      imgs: ['iPhone/iPhone8Plus/front.png', 'iPhone/iPhone8Plus/back.png']
    },
    {//6
      title: 'Iphone 6',
      price: 20000,
      rest: 5,
      description: {
        diagonal: "4.3",
        frontCamera: "1.2",
        mainCamera: "8",
        processor: "A9",
        memory: "32",
        about: `Смартфон Apple iPhone 6 – все, что вам необходимо для полноценных работы и отдыха с мобильным устройством. Изображение на 4.7-дюймовом экране порадует четкостью и максимально детализацией в разрешении 1334х750. Высокоскоростной доступ в Сеть обусловлен поддержкой 4G. А высокая производительность и оперативность исполнения пользовательских команд – результат работы 2-ядерного процессора с частотой и 1.4 ГГц. Запечатлевайте на камеру на 8 Мп все важные моменты, храните все фото и видео на 32 ГБ встроенной памяти. Смартфон Apple iPhone 6 – это металлический корпус, это ионо-закаленное стекло экрана, чтобы его презентабельный вид и работоспособность долгое время оставались на должном уровне.`
      },
      imgs: ['iPhone/iPhone6/front.png', 'iPhone/iPhone6/back.png']
    },
    {//7
      title: 'Iphone 6 Plus',
      price: 40000,
      rest: 8,
      description: {
        diagonal: "4.5",
        frontCamera: "1.2",
        mainCamera: "10",
        processor: "A9",
        memory: "64",
        about: `Смартфон Apple iPhone 6 Plus – все, что вам необходимо для полноценных работы и отдыха с мобильным устройством. Изображение на 4.7-дюймовом экране порадует четкостью и максимально детализацией в разрешении 1334х750. Высокоскоростной доступ в Сеть обусловлен поддержкой 4G. А высокая производительность и оперативность исполнения пользовательских команд – результат работы 2-ядерного процессора с частотой и 1.4 ГГц. Запечатлевайте на камеру на 8 Мп все важные моменты, храните все фото и видео на 32 ГБ встроенной памяти. Смартфон Apple iPhone 6 – это металлический корпус, это ионо-закаленное стекло экрана, чтобы его презентабельный вид и работоспособность долгое время оставались на должном уровне.`
      },
      imgs: ['iPhone/iPhone6Plus/front.png', 'iPhone/iPhone6Plus/back.png']
    },
    {//9
      title: 'Samsung Galaxy S10',
      price: 60000,
      rest: 30,
      description: {
        diagonal: "6.4",
        frontCamera: "12",
        mainCamera: "16",
        processor: "SD33",
        memory: "128",
        about: `Приятный тактильно, керамический корпус Samsung Galaxy S10+ Ceramic устойчив к царапинам – можно не бояться класть смартфон в сумку или карман вместе с ключами и другими металлическими предметами. Samsung Galaxy S10+ предлагает возможности, задающие высокий стандарт для смартфонов. Его функционал достигает немыслимых высот, вполне соперничая даже с профессиональным оборудованием. Вы можете смотреть фильмы на иммерсивном экране, делать профессиональные фотографии, снимать видео без дрожания камеры, будто бы снятые экшн-камерой, и без лишних забот пользоваться смартфоном целый день благодаря емкому аккумулятору.`
      },
      imgs: ['Samsung/GalaxyS10/front.png', 'Samsung/GalaxyS10/back.png']
    },
    {//10
      title: 'Samsung Galaxy S9',
      price: 50000,
      rest: 30,
      description: {
        diagonal: "6.2",
        frontCamera: "10",
        mainCamera: "14",
        processor: "SD30",
        memory: "32",
        about: `Samsung Galaxy  – смартфон с 6.2-дюймовым экраном. Технология изготовления дисплея – Super AMOLED, а разрешение достигает 2340x1080 пикселей. Воспроизведение картины получается детализированным и ярким, но при этом реалистичным.
        Выкладывайте в социальные сети и сохраняйте в альбом четкие насыщенные фотографии. Основная камера поможет запечатлеть свежие эмоции. Красивые селфи с друзьями и близкими получатся на фронтальную с 32 Мп. Для каждой съемки найдется свой подходящий режим. С объемом аккумулятора в 6000 мА*ч смартфон может работать без подзарядки до 48 ч. Восьмиядерный процессор Exynos 961 и оперативная память 6 ГБ позволят устройству плавно выполнять свои задачи. Вам не понадобится вводить и запоминать пароль. Сканер отпечатка пальца за секунду распознают владельца Samsung Galaxy  и разблокируют доступ.`
      },
      imgs: ['Samsung/GalaxyS9/front.png', 'Samsung/GalaxyS9/back.png']
    },
    {//11
      title: 'Samsung Galaxy S8',
      price: 40000,
      rest: 30,
      description: {
        diagonal: "6",
        frontCamera: "8",
        mainCamera: "12",
        processor: "SD29",
        memory: "32",
        about: `Смартфон Samsung Galaxy представляет собой совершенное мобильное устройство для общения, работы и отдыха. Он оснащен достаточно емким аккумулятором (3400 мА•ч) и высокоэффективным, 8-ядерным процессором Exynos 7 Series 7884 собственного производства. Быстродействие процессора дополняет оперативная память емкостью 2 ГБ. Благодаря этим составляющим на смартфоне можно запускать одновременно несколько программ или приложений, постоянно переключаясь между ними.
        Сохранять в смартфоне Samsung Galaxy коллекции любимых песен, фотографий или видео позволяет собственная память, рассчитанная на 32 ГБ. Увеличить ее позволит карта microSD до 512 ГБ. Безрамочный TFT-экран смартфона впечатляет яркой и детализированной картинкой. Любителям фотографий понравятся возможности двух камер: основной (13 Мп) и фронтальной (5 Мп). А выбрать подходящие тарифы для общения позволяет поддержка смартфоном одновременной работы 2 SIM-карт. Расширяют функционал смартфона модули Wi-Fi и Bluetooth.`
      },
      imgs: ['Samsung/GalaxyS8/front.png', 'Samsung/GalaxyS8/back.png']
    },
    {//12
      title: 'Samsung Galaxy S7',
      price: 30000,
      rest: 30,
      description: {
        diagonal: "5.8",
        frontCamera: "5",
        mainCamera: "10",
        processor: "SD27",
        memory: "16",
        about: `Смартфон Samsung Galaxy в черном пластиковом корпусе станет отличным выбором для любителя мобильных игр, стриминга видео и серфинга в интернете. Его безрамочный дисплей диагональю 5.7 дюйма обладает разрешением 1520x720 пикселей и соотношением сторон 19.5:9. Технология Dolby Atmos обеспечивает качественное звуковое сопровождение безупречному изображению на дисплее. Восьмиядерный процессор легко «разгоняется» с 1.45 до 1.95 ГГц, а графический ускоритель Adreno 505 и 2 ГБ оперативной памяти способствуют прохождению игр без «зависаний».
        Двойная основная камера с 8-кратным зумом делает фото с разрешением до 10 Мп. Встроенная память 16 ГБ рассчитана на хранение необходимых приложений, а для личных файлов можно задействовать накопитель объемом до 512 ГБ. Сканер лица гарантирует, что смартфоном Samsung Galaxy A01 не сможет воспользоваться никто, кроме владельца.`
      },
      imgs: ['Samsung/GalaxyS7/front.png', 'Samsung/GalaxyS7/back.png']
    },
    {//13
      title: 'Huawei M9',
      price: 50000,
      rest: 30,
      description: {
        diagonal: "6.4",
        frontCamera: "10",
        mainCamera: "14",
        processor: "DD32",
        memory: "128",
        about: `Смартфон Huawei Lite 128 ГБ выпущен в корпусе коричневого цвета. В дизайне устройства нет ничего лишнего, оформление у него лаконичное. Изготовление корпуса аппарата происходит из высококачественного пластика. Полимерный материал прочный, он приятный на ощупь.
        Функционирует аппарат на ОС Android 8.1 Oreo. Поверх операционной системы производитель поставил собственную оболочку EMUI. Она меняет интерфейс, добавляет в него стильные элементы, полезные возможности для пользователей.
        Смартфон Huawei Lite 128 ГБ работает на процессоре MediaTek MT6739. В нем применяются четыре ядра с частотой 1.5 ГГц. Обработкой графики занимается ускоритель PowerVR GE8100.
        Оперативной памяти в устройстве – 1 ГБ, постоянной – 128 ГБ. Дополнительно можно поставить флеш-накопитель для расширения внутреннего хранилища. Смартфон поддерживает сети 4G. Владелец сможет пользоваться необходимыми онлайн-сервисами даже вдали от точек доступа Wi-Fi.`
      },
      imgs: ['Huawei/huaweiM9/front.png', 'Huawei/huaweiM9/back.png']
    },
    {//14
      title: 'Huawei Nova2',
      price: 50000,
      rest: 30,
      description: {
        diagonal: "5",
        frontCamera: "10",
        mainCamera: "12",
        processor: "DD31",
        memory: "128",
        about: `Смартфон Huawei Nova в привлекательном фиолетовом корпусе из металла и стекла объединяет в себе самые прогрессивные и совершенные технологические решения. За счет 8-ядерного процессора HiSilicon Kirin 980, оперативной памяти размером 6 ГБ и графического ускорителя Mali-G76 MP10 устройство буквально «летает» при прохождении мобильных игр и эффективно работает сразу в нескольких приложениях без «зависаний». За сохранность информации владельца отвечает сканер отпечатков пальцев.
        Благодаря датчику бесконтактной оплаты Google Pay можно смело оставлять платежные карты дома и рассчитываться за покупки буквально в одно касание. За счет 128 ГБ встроенной памяти смартфона Huawei Nova внутри можно хранить огромное количество приложений и файлов.`
      },
      imgs: ['Huawei/huaweiNova2/front.png', 'Huawei/huaweiNova2/back.png']
    }
  ]

  phones.forEach(phone => {
    firebase.firestore().collection("phones").add(phone)
      .then(function (docRef) {
        console.log("docRef: ", docRef)
        console.log("Document written with ID: ", docRef.id)
      })
      .catch(function (error) {
        console.error("Error adding document: ", error);
      });
  })
}

function addTelevisions() {
  console.log('addTelevisions was called')

  let televisions = [
    {//1
      title: 'Samsung UE32T5300AU',
      price: 16890,
      rest: 20,
      description: {
        diagonal: "32",
        screenResolution: "1920x1080",
        wifi: "true",
        hz: 50,
        about: 'Телевизор Samsung UE32T5300AU обладает диагональю 32 дюйма (80 см), оптимальной для установки в помещения со средней площадью. Благодаря поддержке Smart TV эта модель приобрела функционал компьютера: вы сможете просматривать ролики на YouTube, общаться в Skype, воспользоваться браузером и устанавливать различный софт. Подключение к сети Интернет осуществляется через интегрированный Wi-Fi-адаптер. Вам обеспечена детализированная передача изображения, отображаемого в формате высокой четкости Full HD (разрешение 1920x1080 пикселей).'
      },
      imgs: ['samsung/UE32T5300AU/front.png', 'samsung/UE32T5300AU/1.png']
    },
    {//2
      title: 'Samsung T32E310EX',
      price: 14490,
      rest: 25,
      description: {
        diagonal: "31.5",
        screenResolution: "1920x1080",
        wifi: "true",
        hz: 50,
        about: `Телевизор Samsung T32E310EX оснащен экраном с разрешающей способностью 1920x1080 пикселей. Прием сигнала производится в формате цифрового и кабельного вещания. Поддерживаются телевизионные стандарты PAL, SECAM. За звучание отвечают встроенные двухканальные стереодинамики мощностью 10 Вт. Даже без подключения дополнительных аудиоустройств звук будет приятным и чистым.
        Телевизор идеально подойдет для больших семей, его углы обзора по 178 градусов обеспечат качественное изображения вне зависимости от угла просмотра.ЖК - телевизор Samsung T32E310EX объединяет в себе как стандартное ТВ- устройство, так и монитор для консоли или ПК.Широкоформатное разрешение позволит даже вблизи ощущать четкость и глубину передаваемого изображения.Прибор можно устанавливать на стену при помощи VESA- крепления или пользоваться стандартной подставкой с антибликовым покрытием.`
      },
      imgs: ['samsung/T32E310EX/front.png', 'samsung/T32E310EX/1.png']
    },
    {//3
      title: 'Samsung UE43TU8000U',
      price: 31000,
      rest: 30,
      description: {
        diagonal: "43",
        screenResolution: "3840x2160",
        wifi: "true",
        hz: 100,
        about: `Телевизор Samsung UE43TU8000U обладает широким набором функций, с которыми достигается абсолютный комфорт при просмотре не только телевизионного контента, но и всевозможных видео. Это возможно с поддержкой Smart TV, позволяющего выбирать действительно стоящий контент для просмотра, отфильтровывая ненужное. Стабильному соединению с сетью способствует модуль Wi-Fi. Модель с диагональю 43" (109 см) функционирует под управлением Tizen.
        Samsung UE43T5300AUXRU поддерживает формат FullHD, при котором изображение обладает разрешением 3840x2160. Технология HDR поражает точной цветопередачей и улучшенной четкостью изображения, поэтому даже в самых темных эпизодах изображение будет детализированным. Демонстрация изображения с минимальными искажениями возможна благодаря функции "Ultra Clean View", которая анализирует контент. С тюнерами DVB-T, DVB-C, DVB-T2, DVB-S вы получаете все, чтобы насладиться просмотром телеканалов без установки дополнительного оборудования: нужно всего лишь включить автопоиск.`
      },
      imgs: ['samsung/UE43TU8000U/front.png', 'samsung/UE43TU8000U/1.png']
    },
    {//4
      title: 'Samsung UE50NU7002U',
      price: 35990,
      rest: 20,
      description: {
        diagonal: "50",
        screenResolution: "3840x2160",
        wifi: "true",
        hz: 100,
        about: `Телевизор Samsung UE50NU7002U с диагональю экрана 50" (125 см) позволит насладиться реалистичным и детальным изображением, поскольку поддерживает формат 4K, который соответствует разрешению 3840x2160 пикселей. Технология Direct LED предполагает равномерное распределение светодиодов по всему периметру экрана, что обеспечивает более насыщенное и яркое изображение. Порт USB позволяет подключать к телевизору внешние носители, чтобы вы могли воспроизводить файлы, содержащиеся на флеш-картах и мобильных устройствах.
        Samsung UE50NU7002U предусматривает встроенные тюнеры DVB-T, DVB-T2, DVB-C, DVB-S2, что избавляет от необходимости установки внешней приставки, позволяя насладиться просмотром любимых цифровых телеканалов. Для этого нужно включить автоматический поиск. Возможность пользоваться неограниченно сетевым контентом предоставляет встроенный модуль Wi-Fi и технология Smart TV. Модель поддерживает объемное звучание благодаря динамикам общей мощностью 20 Вт.`
      },
      imgs: ['samsung/UE50NU7002U/front.png', 'samsung/UE50NU7002U/1.png']
    },
    {//5
      title: 'LG 43UK6200',
      price: 23990,
      rest: 22,
      description: {
        diagonal: "43",
        screenResolution: "3840x2160",
        wifi: "true",
        hz: 50,
        about: `Телевизор LG 43UK6200 поддерживает цифровые тюнеры DVB-T, DVB-T2, DVB-C, DVB-S и DVB-S2, благодаря чему вам доступно не только кабельное, но и спутниковое телевещание. Имеется функция телетекста, которая позволит вам ознакомиться с интересующей вас информацией касательно погоды, расписания транспорта, мировых новостей и др., не отрываясь от просмотра телепередачи. Качественный звук не менее важен, чем красочный видеоряд, поэтому модель оснащена динамиками, выдающими глубокий и насыщенный звук мощностью 20 Вт. Функция объемного звучания позволит вам с головой погрузиться в происходящее на экране.
        Телевизор DVB-T, DVB-T2, DVB-C, DVB-S, DVB-S2 поддерживает огромное количество файлов и кодеков, благодаря чему у вас не возникнет проблем с воспроизведением того или иного файла. Благодаря присутствию в конструкции устройства сразу двух USB-портов вы сможете подключить к нему внешние накопители данных для просмотра интересующего вас видео и различную периферию для более удобной навигации по меню.`
      },
      imgs: ['lg/43UK6200/front.png', 'lg/43UK6200/1.png']
    },
    {//5
      title: 'LG 55UM7300',
      price: 36180,
      rest: 25,
      description: {
        diagonal: "55",
        screenResolution: "3840x2160",
        wifi: "true",
        hz: 100,
        about: "Телевизор LG 50UM7300PLB показывает картинку с разрешением Ultra HD, 3840х2160 пикселей, что соответствует стандарту 4K. Она выглядит чрезвычайно реалистично, и у вас не возникнет сложностей с тем, чтобы рассмотреть мельчайшие детали. Технология TruMotion 100 обеспечивает плавную передачу движения в динамичных сценах, а благодаря поддержке HDR цвета будут яркими, насыщенными и совершенно естественными."
      },
      imgs: ['lg/55UM7300/front.png', 'lg/55UM7300/1.png']
    },
    {//7
      title: 'LG 50UM7300',
      price: 33110,
      rest: 24,
      description: {
        diagonal: "50",
        screenResolution: "3840x2160",
        wifi: "false",
        hz: 50,
        about: `Телевизор поддерживает цифровые тюнеры DVB-T, DVB-T2, DVB-C, DVB-S и DVB-S2, благодаря чему вам доступно не только кабельное, но и спутниковое телевещание. Имеется функция телетекста, которая позволит вам ознакомиться с интересующей вас информацией касательно погоды, расписания транспорта, мировых новостей и др., не отрываясь от просмотра телепередачи. Качественный звук не менее важен, чем красочный видеоряд, поэтому модель оснащена динамиками, выдающими глубокий и насыщенный звук мощностью 20 Вт.`
      },
      imgs: ['lg/50UM7300/front.png', 'lg/50UM7300/1.png']
    },
    {//8
      title: 'Sony KDL-40RE353',
      price: 25000,
      rest: 60,
      description: {
        diagonal: "40",
        screenResolution: "1920x1080",
        wifi: "false",
        hz: 50,
        about: `LED-телевизор Sony KDL-40RE353 с диагональю экрана 40" (101 см) представлен в черном корпусе с устойчивой подставкой. Подставку при необходимости можно убрать и тогда вы получаете возможность закрепить аппарат на стене, ведь модель соответствует стандарту VESA 100x100.
        Разрешение 1920x1080 (FullHD) позволяет оценить естественность и детализацию изображения, перейти к нюансам. Пользователь получает четкое изображение, обладающее повышенной степенью контрастности, что доставляет при просмотре удовольствие. Углы обзора Sony KDL-40RE353 составляют 178°/178°, поэтому не стоит переживать об искажении картинки: с любого ракурса она будет стабильной четкой.
        DVB-T, DVB-T2, DVB-C – поддерживаемые моделью цифровые тюнеры. Благодаря им пользователь получает возможность выбора предпочитаемого канала вещания. Для подключения накопителей, а также мультимедийной и цифровой техники телевизор оборудован разъемами HDMI, USB.`
      },
      imgs: ['sony/KDL-40RE353/front.png', 'sony/KDL-40RE353/1.png']
    },
    {//9
      title: 'Sony KD-55XG7005',
      price: 54000,
      rest: 15,
      description: {
        diagonal: "54.6",
        screenResolution: "3840x2160",
        wifi: "true",
        hz: 50,
        about: `Телевизор LED Sony KD-55XG7005 с диагональю экрана 55" (139 см) представлен в черном корпусе и устанавливается на съемную подставку. С ним вы получаете возможность просмотра любимых цифровых телеканалов при поддержке встроенных тюнеров DVB-T, DVB-T2, DVB-C, DVB-S: вам необходимо будет лишь включить автоматический поиск. Телевизор поддерживает фиксацию на стене, поскольку поддерживает стандарт крепления VESA 200x200. Такой способ крепления будет оптимальным для устройства таких размеров. Встроенный модуль Wi-Fi, а также поддержка Smart TV открывают доступ к сетевому контенту.
        Sony KD-55XG7005 поддерживает технологию 4K X-Reality PRO, что способствует повышению разрешения изображения до 3840x2160, позволяя достичь невероятной четкости и улучшенной обработки деталей изображения. Благодаря технологии TRILUMINOS Display телевизор будет отображать живые цвета в широком диапазоне, что позволит видеть на экране реалистичные оттенки и тона. Система Motionflow XR способствует плавности динамичных сцен.`
      },
      imgs: ['sony/KD-55XG7005/front.png', 'sony/KD-55XG7005/1.png']
    },
    {//10
      title: 'Sony KDL-43WF665',
      price: 30999,
      rest: 28,
      description: {
        diagonal: "40",
        screenResolution: "1920x1080",
        wifi: "false",
        hz: 50,
        about: `43-дюймовый телевизор LED Sony KDL-43WF665 имеет классический дизайн: корпус телеприемника окрашен в строгий черный цвет. Телевизор имеет широко распространенное разрешение: 1920x1080. Этот параметр, а также размер экрана свидетельствуют о возможности эффективного использования модели в больших помещениях, например – в гостиных или конференц-залах. Одним из преимуществ телевизора является тип подсветки (Direct LED), сильной стороной которого является равномерность освещенности экрана.
        Телевизор LED Sony KDL-43WF665 имеет поддержку Smart TV. Вам будет доступен широчайший выбор каналов интернет-телевидения. Smart TV также позволяет использовать и другие онлайн-развлечения. В наличии встроенный модуль Wi-Fi. Есть и возможность проводного подключения к Интернету, с использованием порта Ethernet (RJ-45). Для подключения внешних источников мультимедиа-данных применяются 2 порта USB. Телевизор имеет возможность записи видео и функцию отложенного просмотра. Полезной для многих пользователей станет возможность подключения наушников.`
      },
      imgs: ['sony/KDL-43WF665/front.png', 'sony/KDL-43WF665/1.png']
    },
    {//11
      title: 'Sony KD-55XG9505',
      price: 99990,
      rest: 30,
      description: {
        diagonal: "40",
        screenResolution: "3840x2160",
        wifi: "false",
        hz: 120,
        about: `Детализированная 4К картинка с яркой цветопередачей прекрасно сочетается с технологией Sound-from-Picture Reality в телевизоре Sony KD-55XG9505. Благодаря невероятной вычислительной мощности процессор обработки изображений X1 Ultimate обнаруживает сотни различных объектов на экране и улучшает яркость, детализацию и цветопередачу так, что все выглядит четким и чрезвычайно реалистичным. Система Acoustic Multi-Audio предусматривает установку двух высокочастотных динамиков для создания эффекта перемещения звука в задней части телевизора, где расположены динамики с фазоинвертором. Эти динамики обеспечивают работу технологии Sound-from-Picture Reality. Благодаря четко слаженным картинке и звуку впечатления от просмотра будут еще ярче. Телевизор Sony KD-55XG9505 создан, чтобы дарить незабываемые впечатления от просмотра на большом экране. Превосходная картинка ни на секунду не позволит вам усомниться в реалистичности происходящего на экране.`
      },
      imgs: ['sony/KD-55XG9505/front.png', 'sony/KD-55XG9505/1.png']
    }
  ]

  televisions.forEach(tv => {
    firebase.firestore().collection("televisions").add(tv)
      .then(function (docRef) {
        console.log("docRef: ", docRef)
        console.log("Document written with ID: ", docRef.id)
      })
      .catch(function (error) {
        console.error("Error adding document: ", error);
      });
  })
}

function addTablets() {
  console.log('addPhones was called')

  let tablets = [
    {//1
      title: 'Apple iPad (2019)',
      price: 26999,
      rest: 25,
      description: {
        diagonal: "10.2",
        frontCamera: "1.2",
        mainCamera: "8",
        processor: "Apple A10",
        memory: "32",
        about: `Планшет Apple iPad 2019 поможет быстрее и с большим удовольствием справиться с работой, а потом насладиться 
        заслуженным отдыхом. На большом, 10.2-дюймовом экране с высокой плотностью пикселей (Retina) и IPS-матрицей картинка 
        удивительно яркая, детализированная и красочная. Просмотр фильмов и роликов станет настоящим удовольствием, тем более, 
        что звук не отстает по качеству от изображения.
        \nApple iPad 2019 оснащен специально разработанной для планшетов операционной системой iPadOS, 
        в которой появилось немало интересных и полезных функций, помогающих быстрее переключаться между окнами, 
        обрабатывать и набирать тексты (теперь можно использовать полноразмерную клавиатуру Smart Keyboard, появились 
        дополнительные удобные способы взаимодействия с Apple Pencil. На рабочем столе стало отображаться больше информации, 
        а переключение между окнами производится смахиванием. Снимки с камеры стали еще прекраснее и все так же комфортно совершать видеозвонки.`
      },
      imgs: ["ipad/ipad2019-32/front.png", "ipad/ipad2019-32/1.png"]
    },
    {//2
      title: 'Apple iPad (2019)',
      price: 34490,
      rest: 30,
      description: {
        diagonal: "10.2",
        frontCamera: "1.2",
        mainCamera: "8",
        processor: "Apple A10",
        memory: "128",
        about: `Планшет Apple iPad 2019 − универсальный и очень удобный аппарат, представленный в ультратонком корпусе диагональю 10.2". Его экран IPS предусматривает увеличенную площадь, а особенность кроется в поддержке полноразмерной клавиатуры, что поспособствует полноценной работе на этом аппарате. Изображение на экране будет иметь разрешение 2160x1620. Большие возможности предоставляет внутренний диск, который дает 128 ГБ памяти.
        \nApple iPad 2019 позволит решать быстро все задачи, которые стоят перед пользователем. Теперь вы можете использовать сервис FaceTime для звонков коллегам и одновременно работать в Интернете, открывать графические редакторы для работы там. Подключив клавиатуру Smart Keyboard.1 либо открыв экранную клавиатуру, вы сможете приступать к печати текста презентации или курсовой. Аппаратная конфигурация модели представлена процессором A10 Fusion, способным без труда справляться с обработкой графики. Это позволяет планшету работать плавно и быстро при загрузке игровых приложений.`
      },
      imgs: ["ipad/ipad2019-128/front.png", "ipad/ipad2019-128/1.png"]
    },
    {//3
      title: 'Apple iPad mini (2019)',
      price: 41990,
      rest: 30,
      description: {
        diagonal: "7.9",
        frontCamera: "8",
        mainCamera: "7",
        processor: "Apple A12 Bionic",
        memory: "64",
        about: `Планшет Apple iPad mini 2019 в черно-сером металлическом корпусе начинен самыми прогрессивными и технологичными решениями, что делает его идеальным вариантом для человека, который шагает в ногу со временем. IPS-экран модели обладает диагональю 7.9 дюйма. Дисплей с разрешением 2048x1536 пикселей демонстрирует изображение великолепного качества, детализированного и четкого. Тексты на экране, видеоролики и фотографии будут отображаться одинаково хорошо при любом освещении.
        \nВ основе функционирования планшета лежат процессор A12 Bionic, видеопроцессор Apple GPU и 3 ГБ оперативной памяти. Это обеспечивает ему возможность работать сразу в десятке приложений без намека на «зависание». За счет объема памяти 64 ГБ в устройстве можно хранить большое количество программ и файлов. Время работы планшета Apple iPad mini 2019 в активном режиме достигает 10 ч. За сохранность данных владельца отвечает сканер отпечатков пальцев.`
      },
      imgs: ["ipad/ipad-mini-2019-64/front.png", "ipad/ipad-mini-2019-64/1.png"]
    },
    {//4
      title: 'Apple iPad Pro 11 (2020)',
      price: 69900,
      rest: 15,
      description: {
        diagonal: "11",
        frontCamera: "8",
        mainCamera: "12/10 (две камеры)",
        processor: "Apple A12Z Bionic",
        memory: "128",
        about: `Защитное стекло для планшета Apple iPad Pro 11" 2020 полностью покрывает переднюю панель и имеет небольшой вырез на верхней части. Установка данного аксессуара обеспечит высокий уровень защиты экрана от образования царапин, сколов и других негативных последствий, которые могут появиться в случае ударов и падений устройства. Благодаря высокой степени прозрачности цвета на экране передаются точно. Олеофобное покрытие предотвращает появление следов от пальцев и способствует сохранению чувствительности тачскрина. Закаленное стекло Apple iPad Pro 11" 2020 толщиной 0.33 мм легко устанавливается на экране планшетного компьютера благодаря клеевому слою.`
      },
      imgs: ["ipad/ipad-pro-11-128/front.png", "ipad/ipad-pro-11-128/1.png"]
    },
    {//5
      title: 'Apple iPad Air (2019)',
      price: 54000,
      rest: 10,
      description: {
        diagonal: "10.5",
        frontCamera: "7",
        mainCamera: "8",
        processor: "Apple A12 Bionic",
        memory: "256",
        about: `iPad Air открывает широкий доступ к самым передовым разработкам. Процессор A12 Bionic с системой Neural Engine. Дисплей Retina 10,5 дюйма с технологией True Tone. Поддержка Apple Pencil и клавиатуры Smart Keyboard. Кроме того, при толщине всего 6,1 мм iPad Air весит менее 500 г — вы легко сможете всегда держать его при себе.
        \nНесмотря на большой дисплей Retina 10,5 дюйма, iPad Air очень компактный. Он отлично подходит для решения самых разных задач буквально на ходу. Для этого он оснащён самыми передовыми технологиями беспроводной связи, а также аккумулятором, который работает без подзарядки до 10 часов. То есть почти целый день. Мощь и интеллект iPad Air обеспечиваются процессором A12 Bionic с системой Neural Engine. Процессор задействует технологии машинного обучения в режиме реального времени и открывает невероятные возможности для фотографии, игр, дополненной реальности и многого другого. Вы можете редактировать видео, делать впечатляющие презентации, проектировать 3D‑модели, смотреть любимые сериалы онлайн. И делать всё это одновременно. iPad Air оснащён дисплеем Retina 10,5 дюйма с широким цветовым охватом. На этот дисплей хочется смотреть бесконечно. Фотографии, видео и игры выглядят живо и естественно вплоть до мельчайших деталей. И независимо от внешних условий, технология True Tone, повышенная яркость и антибликовое покрытие помогут сделать изображение максимально качественным.`
      },
      imgs: ["ipad/ipad-air-2019-256/front.png", "ipad/ipad-air-2019-256/1.png"]
    },
    {//6
      title: 'Samsung Galaxy Tab A 10.1',
      price: 16990,
      rest: 10,
      description: {
        diagonal: "10.1",
        frontCamera: "5",
        mainCamera: "8",
        processor: "Samsung Exynos 7904",
        memory: "32",
        about: `Планшет Samsung Galaxy Tab A 10.1 (2019) в черном металлическом корпусе станет находкой и для работы, и для развлечений. Благодаря прочной конструкции устройство прослужит долго. Диагональ IPS-дисплея модели составляет 10.1 дюйма и сочетается с его разрешением 1920x1200 пикселей. В комплексе с плотностью 224 ppi это гарантирует пользователю великолепное изображение, детализированное и четкое. За высокую производительность модели отвечают процессор Samsung Exynos 7904 на 8 ядер, видеопроцессор Mali-G71 MP2 и 2 ГБ оперативной памяти. За счет камер с разрешением 5 и 8 Мп можно делать фото, видео и поддерживать связь с близкими в мессенджерах «лицом к лицу».
        \nДля хранения приложений и личных файлов в конфигурации предусмотрено 32 ГБ встроенной памяти. Увеличить этот параметр можно с использованием накопителя microSD, microSDHC, microSDXC размером до 512 ГБ. Для выхода в интернет в корпус планшета Samsung Galaxy Tab A 10.1 (2019) встроен модуль Wi-Fi.`
      },
      imgs: ["galaxy-tab/a10-32/front.png", "galaxy-tab/a10-32/1.png"]
    },
    {//7
      title: 'Samsung Galaxy Tab S6 Lite',
      price: 27460,
      rest: 20,
      description: {
        diagonal: "10.4",
        frontCamera: "5",
        mainCamera: "8",
        processor: "Samsung Exynos 9611",
        memory: "64",
        about: `Планшет Samsung Galaxy Tab S6 Lite является функциональным, надежным и очень удобным аппаратом, представленным в металлическом корпусе с диагональю экрана 10.4". Встроенные 64 ГБ составляют надежную платформу для хранения цифровой информации. Поддержка емкости аккумулятора 7040 мА ч дает возможностью проводить долгие часы за играми, не переживая о том, что устройство быстро потеряет заряд. Функционирует устройство на основе Android 10.x, поэтому дает многочисленные преимущества для пользователей, которые ценят скорость и высокую производительность.
        \nSamsung Galaxy Tab S6 Lite с емкостным экраном мультитач использует электронное перо для того, чтобы вам было легче воплощать свои творческие задумки. Перо функционирует без подзарядки, поэтому вам не придется беспокоиться о его подзарядке. Технология PLS поможет получить четкое изображение, обладающее разрешением 2000x1200. Устройство отличается стабильностью работы приложений и высокоскоростным откликом благодаря 4 ГБ, которые дает оперативный модуль.`
      },
      imgs: ["galaxy-tab/a10-32/front.png", "galaxy-tab/a10-32/1.png"]
    },
    {//8
      title: 'Samsung Galaxy Tab S7',
      price: 57990,
      rest: 30,
      description: {
        diagonal: "11",
        frontCamera: "8",
        mainCamera: "13/5 (две камеры)",
        processor: "Qualcomm Snapdragon 865+",
        memory: "128",
        about: `Планшет Samsung Galaxy Tab S7, выполненный в металлическом корпусе толщиной 6.3 мм, выделяется стильным дизайном, мощными характеристиками и длительной автономной работой. Аппаратная платформа с процессором Qualcomm Snapdragon 865 Plus на 8 ядер и 6 ГБ ОЗУ обеспечивает высокие показатели производительности и скорости системы. Данная модель предлагает под хранение пользовательских данных 128 ГБ и оснащена слотом для карты памяти, что предусматривает возможность расширения внутреннего хранилища.
        \nВ планшете установлен 11-дюймовый дисплей с разрешающей способностью 2560x1600 пикселей. Благодаря матрице IPS достигается высокая реалистичность и красочность изображения. В комплекте предусмотрен стилус для удобства работы с приложениями и контентом на мультисенсорном дисплее. Samsung Galaxy Tab S7 имеет сдвоенную тыловую камеру 13+5 МП и камеру на 8 МП спереди. Беспроводные коммуникационные возможности представлены интерфейсами Wi-Fi и Bluetooth. Аккумулятор емкостью 8000 мА*ч гарантирует до 15 часов автономной работы планшетного компьютера в режиме воспроизведения видео.`
      },
      imgs: ["galaxy-tab/s6-lite/front.png", "galaxy-tab/s6-lite/1.png"]
    },
    {//9
      title: 'HUAWEI MediaPad T5',
      price: 14950,
      rest: 30,
      description: {
        diagonal: "10.1",
        frontCamera: "2",
        mainCamera: "5",
        processor: "HiSilicon Kirin 659",
        memory: "32",
        about: `Планшет Huawei T5 10 представляет собой функциональную модель, чья работоспособность построена на базе 8-ядерного процессора HiSilicon Kirin 659. Его конфигурация предусматривает ядра Cortex-A53, четыре из которых работают на частоте 1.7 ГГц, а оставшиеся четыре - с частотой 2.36 ГГц. В качестве видеопроцессора используется модель Mali-T830 MP2, которая безукоризненно справляется с построением и выводом на экран графической информации. Устройство располагает 3 ГБ оперативной и 32 ГБ встроенной памяти. Доступна установка карты памяти microSD для расширения хранилища данных максимально на 256 ГБ.
        \nПланшет Huawei T5 10 предусматривает модуль сотовой связи, поддерживающий сети 3G и 4G (LTE). Для подключения к локальной беспроводной сети и дальнейшего выхода в Интернет модель оснащена Wi-Fi-модулем, совместимым со стандартами 802.11a/b/g/n/ac. Беспроводной обмен данными с другой цифровой техникой возможен благодаря интегрированному адаптеру Bluetooth 4.2. Имеется тыловая 5-мегапиксельная камера.`
      },
      imgs: ["hyawei/t5/front.png", "hyawei/t5/1.png"]
    },
    {//10 todo
      title: 'HUAWEI MatePad LTE',
      price: 21590,
      rest: 30,
      description: {
        diagonal: "10.4",
        frontCamera: "8",
        mainCamera: "8",
        processor: "HiSilicon Kirin 810",
        memory: "64",
        about: `10.4" Планшет Huawei Matepad 64 ГБ 3G, LTE производится в тонком корпусе с металлическим напылением и оснащается ярким безрамочным экраном с качеством 2K. Устройство рассчитано на универсальные задачи – от работы до развлечений – без ограничений пользователя по требованиям. Даже когда запущены единовременно несколько приложений, реакция 8-ядерного процессора Kirin 810, работающего на частоте 2.27 ГГц, вместе с 4 ГБ оперативной памяти остается быстрой и эффективной. Высокие стандарты Huawei поддерживает операционная система Android 10.x, кроме того, модель поддерживает Bluetooth, Wi-Fi, GPS.
        \n10-дюймовый экран Huawei Matepad производится по технологии IPS и соответствует разрешению 2000x1200 пикселей. Качество видеороликов, игр и приложений порадует реалистичностью, скоростью отклика точек и насыщенной цветовой гамме.
        \nВстроенная память для загрузок достигает 64 ГБ, но ее можно расширить до 512 ГБ с помощью карты. Емкостный мультитач-экран с точным распознаванием прикосновений, две камеры, фронтальная и тыловая, по 8 Мп каждая, встроенные датчики и функции – все в планшете Matepad создано, чтобы пользование им доставило только приятные впечатления.`
      },
      imgs: ["hyawei/matepad-lte/front.png", "hyawei/matepad-lte/1.png"]
    }
  ]

  tablets.forEach(tablet => {
    firebase.firestore().collection("tablets").add(tablet)
      .then(function (docRef) {
        console.log("docRef: ", docRef)
        console.log("Document written with ID: ", docRef.id)
      })
      .catch(function (error) {
        console.error("Error adding document: ", error);
      });
  })
}
